"""
uv venv
uv pip install -e .
uv run examples/main.py
"""
from mishkal import text_to_ipa

text = """
גַּם אִם נָשִׂים בְּצַד עִנְיְנֵי מוּסָר, תַּעֲשִׂיַּת הַבָּשָׂר מַשְׁפִּיעָה מַשְׁמָעוּתִית לְרָעָה עַל כַּדּוּר הָאָרֶץ. מִצַּד שֵׁנִי, קַרְנִיבוֹרִים עֲדַיִן לֹא מָצְאוּ תַּחְלִיף בְּטַעַם וּבְמִרְקָם שֶׁל בָּשָׂר אֲמִתִּי. בְּמַעְבָּדוֹת מִסָּבִיב לְעוֹלָם כְּבָר מְנַסִּים לֹא מְעַט שָׁנִים לְפַצֵּחַ אֶת הָרַעְיוֹן שֶׁל בָּשָׂר מְתֻרְבָּת, אֲבָל עַכְשָׁו עוֹשֶׂה סְטַרְטְאַפּ בְּרִיטִי בְּשֵׁם Meatly צַעַד חָשׁוּב וּמִמִּסְחָר אֶת הַבָּשָׂר הַזֶּה עִם הַשָּׁקַת Chick Bites, בְּשַׂר עוֹף מְתֻרְבָּת שֶׁמְּיֹעָד לַחֲבֵרִים הַטּוֹבִים בְּיוֹתֵר שֶׁל הָאָדָם.
$
"""
# text = "'שָׁלוֹם עוֹלָם"
text = "כְּבָר"
ipa_transcription = text_to_ipa(text)
print(ipa_transcription)