"""
uv pip install -e .
"""

from mishkal.g2p import g2p

text = """
הַפּוֹדְקַאסְטִים הַיִּשְׂרְאֵלִיִּים הָיוּ אִתָּנוּ בְּכָל מָקוֹם וּבְכָל זְמַן בַּשָּׁנָה הָאַחֲרוֹנָה. הֵם הָפְכוּ לִהְיוֹת חֵלֶק בִּלְתִּי נִפְרָד מִשִּׁגְרַת הַיּוֹם שֶׁלָּנוּ בִּמְשִׂימוֹת בְּסִיסִיּוֹת כְּמוֹ שְׁטִיפַת כֵּלִים, נְסִיעוֹת בִּפְקָקִים וְנִקְיוֹנוֹת הַבַּיִת, וְגַם לִוּוּ רַבִּים מֵאִתָּנוּ בִּרְגָעִים לֹא פְּשׁוּטִים כְּמוֹ בְּמִלּוּאִים וּבְמֶרְחָבִים מוּגַנִּים, בֵּין אֵם לְעִדְכּוּנִים, נִתּוּחִים מַעֲמִיקִים אוֹ אֲפִלּוּ פָּשׁוּט אֶסְקַפִּיזְם טָהוֹר. וְעַכְשָׁו, אַחֲרֵי עוֹד שָׁנָה לֹא פְּשׁוּטָה, כְּשֶׁאֶפְשָׁר לַחְזֹר קְצָת לִנְשֹׁם, זֶה הַזְּמַן שֶׁלָּכֶם לְהַחְזִיר לַפּוֹדְאַסְטִים קְצָת אַהֲבָה. זֶה הַזְּמַן לְהַתְחִיל אֶת תַּחֲרוּת פּוֹדְקַאסְט הַשָּׁנָה, שֶׁאֲנַחְנוּ עוֹרְכִים זוֹ הַשָּׁנָה הַשְּׁבִיעִית בִּרְצִיפוּת, בְּעֶזְרַת הַשֻּׁתָּפִים שֶׁלָּנוּ בְּחֶבְרַת Riverside.
"""
text = """
הַפּוֹדְקַאסְטִים
"""
print(g2p(text))

